Table of Contents
 Class ResultOnMesh
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
[DataContract]
[Serializable]
public class ResultOnMesh
Inheritance
object
ResultOnMesh
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ResultOnMesh()
public ResultOnMesh()
Properties
 Displacement
[DataMember]
public List<double[]> Displacement { get; set; }
Property Value
List<double[]>
 Nodes
[DataMember]
public List<double[]> Nodes { get; set; }
Property Value
List<double[]>
 PlatesElement
List of elements for each plate UID
[DataMember]
public List<PlateElements> PlatesElement { get; set; }
Property Value
List<PlateElements>
 Value
[DataMember]
public List<double> Value { get; set; }
Property Value
List<double>
 Edit this page